update generated docs
