--- a/docs/generated/Framework/Eliassen.AspNetCore.Mvc/Middleware/Documentation.md
+++ b/docs/generated/Framework/Eliassen.AspNetCore.Mvc/Middleware/Documentation.md
@@ -1,93 +1,153 @@
+## SearchQueryMiddleware
 
-Class Diagram:
-```dot
+The `SearchQueryMiddleware` class is responsible for enabling IQueryable responses from Controller Actions.
+
+### Class Diagram
+```plantuml
 @startuml
 class SearchQueryMiddleware {
-  - next: RequestDelegate
-  - logger: ILogger<SearchQueryMiddleware>
-  - searchQueryAccessor: IAccessor<ISearchQuery>
-  - modelBuilder: ISearchModelBuilder
+    - private readonly RequestDelegate _next
+    - private ILogger _logger
+    - private IAccessor<ISearchQuery> _searchQueryAccessor
+    - private ISearchModelBuilder _builder
 }
 
-SearchQueryMiddleware -> RequestDelegate
-SearchQueryMiddleware -> ILogger<SearchQueryMiddleware>
-SearchQueryMiddleware -> IAccessor<ISearchQuery>
-SearchQueryMiddleware -> ISearchModelBuilder
+SearchQueryMiddleware -> RequestDelegate: _next
+SearchQueryMiddleware -> ILogger: _logger
+SearchQueryMiddleware -> IAccessor<ISearchQuery>: _searchQueryAccessor
+SearchQueryMiddleware -> ISearchModelBuilder: _builder
 @enduml
 ```
 
-Summary:
+### InvokeAsync Method
